package days02;

/**
 * @author msg
 * @date 2025. 2. 4. - 오후 5:18:58
 * @subject
 * @content
 */
public class Ex05_09 {

	public static void main(String[] args) {
		// [실수 표현](실수 저장 방법)
		//1) 실수 3.14 -> 2진수 표현 -> float 4byte
		//[예]
		/*         -> 2진수 표현(2진법 변환)
		 * 0.625
		 * 0.625 X 2 = [1].25 ↓
		 * 0.25 x 2  = [0].5
		 * 0.5 x 2   = [1].0
		 * 
		 * ->0.101(2진수로 나타낸 0.625)
		 * 
		 * 0.101(2) -> 10진수 실수 변환
		 * 1x2^-1 + 0x2^-2 + 1x2^-3
		 * 
		 * [예] float/double 오차 생긴다. 
		 * 0.123456 유한실수
		 * 0.00011111100110101 무한실수 -> 오차 생김 (실제보다 작은값)
		 * 
		 * 
		 * [예] 9.123456 실수 -> 2진수 실수 변환 -> float(4)/double(8)
		 * 
		 * */

	}//main

}// class
