package days03;

/**
 * @author msg
 * @date 2025. 2. 5. - 오전 11:21:51
 * @subject
 * @content
 */
public class Ex04 {

	public static void main(String[] args) {
		
		
		// [예] 9.123456 실수 -> 2진수 실수 변환 -> float(4)/double(8)
		//     1001.00011111100110101101101111100110101101101111001101011011011110011010110110111100110101101101...
		// 부동소수점 (앞을 1. 으로 고정) (1.+ 가수(M))
		//   1.00100011111100110101101101111100110101101101111001101011011011110011010110110111100110101101101...
		//   X2^3(지수 E)
		
		// 0.000011111
		// 1.1111 x 2^-5
		
		//int(4)
		//----------------------1010
		
		// float(4)
		//  부호   [      8bit E  ] [ 23 M                  ... 그 뒤는 날아감
		// [s(1)][][][][][][][] [][][][][][]
		
		// double(8)
        // 부호 저장[11 E                 ] [ 52M                         ]		
		// [s(1)][][][][][][][]
		
		
		//소수점 뒤(가수) 얼마나 저장되느냐에 따라 --> 배정도 정밀도
		// int =/= float : 저장된 데이터 의미가 달라짐. 
		// 
		
		// BigDecimal 클래스 : 오차없는 실수 사용
		
		
		// [][][][][][][][][][][1][0][0][0][0][1]
		char c = '\u0041';// 한문자를 저장하는 자료형. 유니코드 2바이트.
				System.out.printf("%c",c);
		/*
		 * 10
		 * 
		 * 0000 1010
		 * 
		 * 00 001 010
		 * 0    1   2
		 * 
		 * 0000 1010
		 * 0    a
		 * 
		 * */
		
	} //main

} // class
