package days03;

/**
 * @author msg
 * @date 2025. 2. 5. - 오후 5:26:42
 * @subject
 * @content
 */
public class Ex08 {

	public static void main(String[] args) {
		// [ 연산자를 사용해서 수식으로 표현하는 연습]
		// 1. 정수 x는 짝수(even number)이다.
		//     = 2로 나누어 떨어지는 정수
		//      X % 2 == 0
		// 2. 홀수:  x % 2 != 0  ,  x % 2 == 1
		
		// 3. 정수 x는 2의 배수 또는 3의 배수이다.
		//   x % 2 == 0   ||   x % 3 == 0
		
		// 4. 정수 x는 2의 배수이지만 6의 배수는 아니다.
		//   x % 2 == 0  &&  x % 6 != 0
		
		// 5. 문자 ch는 숫자 (0~9)이다.
		//     0 <= "ch" <= 9
		
		// 6. 문자 ch는 알파벳 대문자이다.
		//    유니코드 65 <= "ch" <= 유니코드 90
		
		// 7. 문자 ch는 알파벳 대문자 또는 소문자이다.
		//    유니코드 65 <= "ch" <= 유니코드 90      ||      유니코드 97 <= "ch" <= 유니코드 122
		

	} // main

} //class
